In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

In [3]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [4]:
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [5]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [6]:
df.tail(2)

    Name   Age Department   Salary
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [7]:
df.iloc[1:3, :2] # rows, columns

      Name   Age
1      Bob  30.0
2  Charlie  35.0

In [8]:
df.loc[1:3, ["Age", "Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance
3   NaN         IT

In [9]:
df.drop("Age", axis = 1) # if make changes in real database then add inplace=True

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [10]:
df.shape

(6, 4)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [12]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [13]:
# Broadcasting
df["Salary"] = df["Salary"] + 5000
df["Salary"]

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [14]:
# Renaming columns:
df.rename(columns = {"Department": "Dept"}, inplace=True)
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

In [15]:
df["Dept"].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [16]:
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [17]:
df["Promoted-Salary"] = df["Salary"] * 10
df

      Name   Age     Dept   Salary  Promoted-Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [18]:
# data cleaning
df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted-Salary    1
dtype: int64

In [19]:
df.dropna(how="any") # any row that has any null value

      Name   Age     Dept   Salary  Promoted-Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
5    Alice  25.0       HR  55000.0         550000.0

In [20]:
df.dropna(how="all") # any row that has all null value

      Name   Age     Dept   Salary  Promoted-Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [24]:
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [25]:
df["Salary"].fillna(df["Salary"].median())

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4    65000.0
5    55000.0
Name: Salary, dtype: float64

In [29]:
# df["Age"].fillna(method="ffill") # forward fill
df["Age"].ffill()

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [31]:
df["Age"].bfill() # backward fill

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [35]:
df["Name"] = df["Name"].replace("Charlie", "Rose")
df

    Name   Age     Dept   Salary  Promoted-Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [38]:
# Duplicates:
df_dup = df[df.duplicated()] # keep="first"
df_dup

    Name   Age Dept   Salary  Promoted-Salary
5  Alice  25.0   HR  55000.0         550000.0

In [40]:
df_dup2 = df[df.duplicated(keep="last")]
df_dup2

    Name   Age Dept   Salary  Promoted-Salary
0  Alice  25.0   HR  55000.0         550000.0

In [43]:
# invalid value:
# Lambda funciton
df["Promoted-Salary"] = df["Promoted-Salary"].apply(lambda x: x/10 if x > 650000 else x)
df

    Name   Age     Dept   Salary  Promoted-Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [51]:
# apply and lambda
def multiplying_age(x):
    return x*2
df["Age"] = df["Age"].apply(multiplying_age)

In [46]:
df

    Name   Age     Dept   Salary  Promoted-Salary
0  Alice  50.0       HR  55000.0         550000.0
1    Bob  60.0       IT  65000.0         650000.0
2   Rose  70.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  58.0       HR      NaN              NaN
5  Alice  50.0       HR  55000.0         550000.0

In [49]:
df["Age"] = df["Age"].apply(lambda x: x/2)

In [54]:
df

    Name   Age     Dept   Salary  Promoted-Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [58]:
# joins and merges
department_info = {
    "Dept": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}

df2 = pd.DataFrame(department_info)
df2

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [60]:
pd.concat([df, df2])

    Name   Age     Dept   Salary  Promoted-Salary       Location Manager
0  Alice  25.0       HR  55000.0         550000.0            NaN     NaN
1    Bob  30.0       IT  65000.0         650000.0            NaN     NaN
2   Rose  35.0  Finance  75000.0          75000.0            NaN     NaN
3  David   NaN       IT  67000.0          67000.0            NaN     NaN
4    Eve  29.0       HR      NaN              NaN            NaN     NaN
5  Alice  25.0       HR  55000.0         550000.0            NaN     NaN
0    NaN   NaN       HR      NaN              NaN       New York   Laura
1    NaN   NaN       IT      NaN              NaN  San Francisco   Steve
2    NaN   NaN  Finance      NaN              NaN        Chicago    Nina

In [63]:
pd.concat([df, df2], axis=1)

,Name,Age,Dept,Salary,Promoted-Salary,Dept,Location,Manager
0,Alice,25.0,HR,55000.0,550000.0,HR,New York,Laura
1,Bob,30.0,IT,65000.0,650000.0,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,75000.0,Finance,Chicago,Nina
3,David,NaN,IT,67000.0,67000.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN
5,Alice,25.0,HR,55000.0,550000.0,NaN,NaN,NaN

In [65]:
pd.merge(df, df2, on="Dept")

    Name   Age     Dept   Salary  Promoted-Salary       Location Manager
0  Alice  25.0       HR  55000.0         550000.0       New York   Laura
1    Bob  30.0       IT  65000.0         650000.0  San Francisco   Steve
2   Rose  35.0  Finance  75000.0          75000.0        Chicago    Nina
3  David   NaN       IT  67000.0          67000.0  San Francisco   Steve
4    Eve  29.0       HR      NaN              NaN       New York   Laura
5  Alice  25.0       HR  55000.0         550000.0       New York   Laura